In [1]:
import numpy as np
import pandas as pd

In [2]:
pay = pd.read_csv(r"G:\Data Science Project\Resources\2023-11-16-Capstone Project-1 Data Analysis using Pandas\Capstone Project-1 Data Analysis using Pandas\City_of_Chicago_Payroll_Data.csv")
pay

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN
...,...,...,...,...,...,...,...,...
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,$93354.00,NaN
32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,$115932.00,NaN

In [3]:
pay.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               32658 non-null  object
 1   Job Titles         32658 non-null  object
 2   Department         32658 non-null  object
 3   Full or Part-Time  32658 non-null  object
 4   Salary or Hourly   32658 non-null  object
 5   Typical Hours      7883 non-null   float64
 6   Annual Salary      24775 non-null  object
 7   Hourly Rate        7883 non-null   object
dtypes: float64(1), object(7)
memory usage: 2.0+ MB

In [4]:
pay.isna().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        24775
Annual Salary         7883
Hourly Rate          24775
dtype: int64

In [5]:
pay.describe()

       Typical Hours
count    7883.000000
mean       34.698719
std         9.145553
min        10.000000
25%        20.000000
50%        40.000000
75%        40.000000
max        40.000000

In [6]:
pay.describe(include="all")

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
count,32658,32658,32658,32658,32658,7883.000000,24775,7883
unique,32350,1095,36,2,2,NaN,1038,167
top,"HERNANDEZ, JUAN C",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,$35.60
freq,5,9393,12973,30676,24775,NaN,2368,1404
mean,NaN,NaN,NaN,NaN,NaN,34.698719,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,9.145553,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,10.000000,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,20.000000,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,40.000000,NaN,NaN

1.	What are the maximum, minimum and average Typical Hours? (use 'Typical Hours' column)

In [7]:
pay["Typical Hours"].max()

40.0

In [8]:
pay["Typical Hours"].min()

10.0

In [9]:
pay["Typical Hours"].mean()

34.69871876189268

In [10]:
print("Max Typical Hour are :", pay["Typical Hours"].max())
print("Min Typical Hour are :", pay["Typical Hours"].min())
print("Average Typical Hour are :", pay["Typical Hours"].mean())

Max Typical Hour are : 40.0
Min Typical Hour are : 10.0
Average Typical Hour are : 34.69871876189268

2.	How many employees are on salary and how many are working on hourly basis?

In [11]:
pay["Salary or Hourly"].value_counts()

Salary or Hourly
Salary    24775
Hourly     7883
Name: count, dtype: int64

In [12]:
pay.groupby("Salary or Hourly").count()[["Name"]]

                   Name
Salary or Hourly
Hourly             7883
Salary            24775

3.	Which department has maximum no of employees?

In [13]:
pay.Department.value_counts().head(1)

Department
POLICE    12973
Name: count, dtype: int64

In [14]:
pay.groupby("Department").count()[["Name"]].idxmax()

Name    POLICE
dtype: object

In [15]:
pay.groupby("Department").count().sort_values(by = "Name", ascending = False).head(1)[["Name"]]

             Name
Department
POLICE      12973

4.	How many employees are on Salary and how many are on Hourly in the Police department?

In [16]:
a = pay[pay.Department == "POLICE"]
a

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN
7,"ELKINS, ERIC J",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
8,"ESTRADA, LUIS F",POLICE OFFICER,POLICE,F,Salary,NaN,$96060.00,NaN
9,"EWING, MARIE A",CLERK III,POLICE,F,Salary,NaN,$53076.00,NaN
...,...,...,...,...,...,...,...,...
32652,"ZYGMUNT, DAWID",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,$93354.00,NaN

In [17]:
a.groupby("Salary or Hourly").count()[["Name"]]

                   Name
Salary or Hourly
Hourly               32
Salary            12941

In [18]:
pay[pay.Department == "POLICE"]["Salary or Hourly"].value_counts()

Salary or Hourly
Salary    12941
Hourly       32
Name: count, dtype: int64

5.	What are the mean, max and min salaries?

In [19]:
pay["Salary"] = pay["Annual Salary"].str.replace("$", "").astype(float)

In [20]:
pay["Salary"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 32658 entries, 0 to 32657
Series name: Salary
Non-Null Count  Dtype
--------------  -----
24775 non-null  float64
dtypes: float64(1)
memory usage: 255.3 KB

In [21]:
print("Max Salary is :", pay.Salary.max())
print("Min Salary is :", pay.Salary.min())
print("Avg Salary is :", pay.Salary.mean())

Max Salary is : 300000.0
Min Salary is : 0.96
Avg Salary is : 87512.78024137235

6.	Find an employee who has the maximum salary

In [22]:
pay[pay["Salary"]==pay.Salary.max()]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary
8310,"EVANS, GINGER S",COMMISSIONER OF AVIATION,AVIATION,F,Salary,NaN,$300000.00,NaN,300000.0

In [23]:
pay.loc[pay["Salary"].idxmax()]

Name                         EVANS,  GINGER S
Job Titles           COMMISSIONER OF AVIATION
Department                           AVIATION
Full or Part-Time                           F
Salary or Hourly                       Salary
Typical Hours                             NaN
Annual Salary                      $300000.00
Hourly Rate                               NaN
Salary                               300000.0
Name: 8310, dtype: object

7.	What are the mean, max and min Hourly Rate?

In [24]:
pay["H_rate"]=pay["Hourly Rate"].str.replace("$", "").astype(float)

In [25]:
print("Max Salary of Hourly Rate is :",pay["H_rate"].max())
print("Min Salary of Hourly Rate is :",pay["H_rate"].min())
print("Avg Salary of Hourly Rate is :",pay["H_rate"].mean())

Max Salary of Hourly Rate is : 96.0
Min Salary of Hourly Rate is : 2.65
Avg Salary of Hourly Rate is : 32.86819231257135

8.	How many employees are getting max Hourly Rate?

In [26]:
pay[pay["H_rate"] == pay["H_rate"].max()].count()["Name"]

1

9.	Who is getting max Hourly Rate?

In [27]:
pay[pay["H_rate"] == pay["H_rate"].max()]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_rate
14317,"JONES, JOHN W",PSYCHIATRIST,HEALTH,F,Hourly,35.0,NaN,$96.00,NaN,96.0

In [28]:
pay.iloc[[pay["H_rate"].idxmax()]]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_rate
14317,"JONES, JOHN W",PSYCHIATRIST,HEALTH,F,Hourly,35.0,NaN,$96.00,NaN,96.0

10.	How many employees are earning less than the average Hourly Rate?

In [29]:
pay[pay["H_rate"] < pay["H_rate"].mean()]["Name"].count()

2791

11.	How many employees are paid hourly and they have full-time job?

In [30]:
pay[(pay["Full or Part-Time"]=="F") & (pay["Salary or Hourly"] == "Hourly")]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_rate
11,"FITCH, JORDAN M",LAW CLERK,LAW,F,Hourly,35.0,NaN,$14.51,NaN,14.51
56,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,NaN,$46.10,NaN,46.10
57,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,$35.60,NaN,35.60
71,"ABDULLAH, RASHAD",ELECTRICAL MECHANIC-AUTO-POLICE MTR MNT,GENERAL SERVICES,F,Hourly,40.0,NaN,$46.10,NaN,46.10
73,"ABDUL-SHAKUR, TAHIR",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,$20.77,NaN,20.77
...,...,...,...,...,...,...,...,...,...,...
32637,"ZURAWSKI, MAC Z",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,$36.21,NaN,36.21
32639,"ZUREK, FRANCIS",ELECTRICAL MECHANIC,OEMC,F,Hourly,40.0,NaN,$46.10,NaN,46.10
32644,"ZWARYCZ, THOMAS J",POOL MOTOR TRUCK DRIVER,WATER MGMNT,F,Hourly,40.0,NaN,$35.60,NaN,35.60
32650,"ZYGADLO, JOHN P",MACHINIST (AUTOMOTIVE),GENERAL SERVICES,F,Hourly,40.0,NaN,$46.35,NaN,46.35
32651,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,F,Hourly,40.0,NaN,$48.85,NaN,48.85

In [31]:
pay[(pay["Full or Part-Time"]=="F") & (pay["Salary or Hourly"] == "Hourly")].count()["Name"]

5906

12.	Find the full-time employees who are working at hourly rate of $10.00?

In [32]:
pay[pay["Hourly Rate"] == "$10.00"]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_rate
1232,"AYALA JR, JESUS",STUDENT INTERN,HUMAN RESOURCES,F,Hourly,35.0,NaN,$10.00,NaN,10.0
4522,"CERVANTES, BIANCA A",STUDENT INTERN,BUDGET & MGMT,F,Hourly,35.0,NaN,$10.00,NaN,10.0
5857,"COX, TALENA",STUDENT INTERN,COMMUNITY DEVELOPMENT,P,Hourly,20.0,NaN,$10.00,NaN,10.0
6476,"DAVILA, ROBERTO A",ALDERMANIC AIDE,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0
9999,"GEERS, DIANE M",ALDERMANIC AIDE,CITY COUNCIL,P,Hourly,20.0,NaN,$10.00,NaN,10.0
16474,"LEVY, ETHAN",CLERK CITY COUNCIL,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0
22154,"PARHAM, ALYSSA M",STUDENT INTERN,BUSINESS AFFAIRS,P,Hourly,20.0,NaN,$10.00,NaN,10.0
30826,"WASHINGTON, LUCILLE",LEGISLATIVE AIDE,CITY COUNCIL,P,Hourly,20.0,NaN,$10.00,NaN,10.0

In [33]:
pay[pay["Full or Part-Time"] == "F"]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN,107790.0,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN,114324.0,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN,76932.0,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN,111474.0,NaN
...,...,...,...,...,...,...,...,...,...,...
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN,90024.0,NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN,48078.0,NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN,87006.0,NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,$93354.00,NaN,93354.0,NaN
32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,$115932.00,NaN,115932.0,NaN

In [34]:
pay[(pay["Hourly Rate"] == "$10.00") & (pay["Full or Part-Time"] == "F")]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,H_rate
1232,"AYALA JR, JESUS",STUDENT INTERN,HUMAN RESOURCES,F,Hourly,35.0,NaN,$10.00,NaN,10.0
4522,"CERVANTES, BIANCA A",STUDENT INTERN,BUDGET & MGMT,F,Hourly,35.0,NaN,$10.00,NaN,10.0
6476,"DAVILA, ROBERTO A",ALDERMANIC AIDE,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0
16474,"LEVY, ETHAN",CLERK CITY COUNCIL,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0

13.	How many unique Job Titles are there in the data?

In [35]:
pay["Job Titles"].unique()

array(['LIEUTENANT', 'SERGEANT', 'LIEUTENANT-EMT', ...,
       'COORD OF PRINTING SERVICES - GRAPHICS', 'PROJECT DIR',
       'MECHANICAL ENGINEER IV'], dtype=object)

In [36]:
pay["Job Titles"].nunique()

1095

14.	What was the average Salary of the employees in each department?

In [37]:
pay["Salary"].mean()

87512.78024137235

In [38]:
pay.groupby("Department")["Salary"].mean()

Department
ADMIN HEARNG             78912.947368
ANIMAL CONTRL            66089.684211
AVIATION                 76140.018777
BOARD OF ELECTION        56051.142857
BOARD OF ETHICS          94552.500000
BUDGET & MGMT            93925.395349
BUILDINGS                98864.833534
BUSINESS AFFAIRS         80446.425000
CITY CLERK               69762.439024
CITY COUNCIL             63577.172069
COMMUNITY DEVELOPMENT    88363.257143
COPA                     98784.705882
CULTURAL AFFAIRS         87048.909091
DISABILITIES             82431.724138
DoIT                     99681.029703
FAMILY & SUPPORT         79013.588785
FINANCE                  73276.364662
FIRE                     97762.348662
GENERAL SERVICES         83095.528390
HEALTH                   85488.210938
HUMAN RELATIONS          93778.588235
HUMAN RESOURCES          79851.761194
INSPECTOR GEN            84030.666667
IPRA                     94429.285714
LAW                      84582.814404
LICENSE APPL COMM        80568.000000
MAYOR'S OFFICE           96165.512308
OEMC                     73153.778221
POLICE                   87836.025349
POLICE BOARD             86136.000000
PROCUREMENT              83278.243902
PUBLIC LIBRARY           71273.288136
STREETS & SAN            84347.775701
TRANSPORTN               89976.896061
TREASURER                88062.652174
WATER MGMNT              89894.111803
Name: Salary, dtype: float64

15.	What is the job title of 'AGAR, BULENT B'?

In [39]:
pay[pay["Name"]=="AGAR,  BULENT B"]["Job Titles"]

230    CHIEF ENGINEER OF SEWERS
Name: Job Titles, dtype: object

16.	What are the top most common job titles?

In [40]:
pay["Job Titles"].value_counts().head(1)

Job Titles
POLICE OFFICER    9393
Name: count, dtype: int64

17.	How many people have the word 'officer' in their job title? (This is pretty tricky)

In [41]:
def find_string(title):
    if "OFFICER" in title.upper():
        return True
    else:
        return False

In [42]:
pay["Job Titles"].apply(find_string)

0        False
1        False
2        False
3        False
4        False
         ...
32653     True
32654     True
32655     True
32656     True
32657    False
Name: Job Titles, Length: 32658, dtype: bool

In [43]:
pay["Job Titles"].apply(find_string).sum()

11101

In [44]:
sum(pay["Job Titles"].apply(find_string))

11101